In [1]:
import seaborn as sns

/home/matias/jupyterhub/lib/python3.7/site-packages/matplotlib/__init__.py:886: MatplotlibDeprecationWarning:
examples.directory is deprecated; in the future, examples will be found relative to the 'datapath' directory.
  "found relative to the 'datapath' directory.".format(key))

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
import numpy as np
import pandas as pd

In [5]:
titanic['survived'] = pd.Categorical(titanic['survived'])

In [6]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

In [10]:
titanic['sex'] = pd.Categorical(titanic['sex'])

# Tablas de frecuencia

In [8]:
    tab = pd.crosstab(index = titanic['survived'], columns = 'pasajeros')
    tab

col_0     pasajeros
survived
0               549
1               342

In [9]:
pd.crosstab(index = titanic['pclass'], columns = 'pasajeros')

col_0   pasajeros
pclass
1             216
2             184
3             491

In [12]:
pd.crosstab(index = titanic['sex'], columns = 'pasajeros')

col_0   pasajeros
sex
female        314
male          577

In [15]:
tab_c= pd.crosstab(index=titanic['deck'], columns = "count") #no convertido a factor

tab_c/tab_c.sum() # Frecuencia relativa

In [17]:
tab/tab.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

# Tabla de frecuencia para dos variables

In [20]:
survived_sex = pd.crosstab(index = titanic['survived'], columns = titanic['sex'])

survived_sex.index = ["died", "survived"]
survived_sex

sex       female  male
died          81   468
survived     233   109

In [30]:
survived_class = pd.crosstab(index = titanic['survived'], columns = titanic['pclass'], margins = True)

survived_class.index = ["palmo", "no palmo", "total_clase"]
survived_class.columns = ["primera","segunda", "tercera", "total_superv"]

survived_class

             primera  segunda  tercera  total_superv
palmo             80       97      372           549
no palmo         136       87      119           342
total_clase      216      184      491           891

# Frecuencia relativas globales

In [32]:
survived_class/survived_class.loc["total_clase", "total_superv"]

              primera   segunda   tercera  total_superv
palmo        0.089787  0.108866  0.417508      0.616162
no palmo     0.152637  0.097643  0.133558      0.383838
total_clase  0.242424  0.206510  0.551066      1.000000

# Frecuencias relativas marginales

In [33]:
survived_class/survived_class.loc['total_clase'] #Por columna

             primera   segunda   tercera  total_superv
palmo        0.37037  0.527174  0.757637      0.616162
no palmo     0.62963  0.472826  0.242363      0.383838
total_clase  1.00000  1.000000  1.000000      1.000000

In [34]:
 survived_class.T/survived_class["total_superv"] #Por fila, usando transposición

                 palmo  no palmo  total_clase
primera       0.145719  0.397661     0.242424
segunda       0.176685  0.254386     0.206510
tercera       0.677596  0.347953     0.551066
total_superv  1.000000  1.000000     1.000000

In [35]:
survived_class.div(survived_class["total_superv"], axis = 0) #Por fila,usando la función div

              primera   segunda   tercera  total_superv
palmo        0.145719  0.176685  0.677596           1.0
no palmo     0.397661  0.254386  0.347953           1.0
total_clase  0.242424  0.206510  0.551066           1.0

# Tablas multi dimensionales

In [41]:
surv_sex_class = pd.crosstab(index = titanic['survived'], columns = [titanic["sex"],titanic["pclass"]], margins = True)

surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [44]:
surv_sex_class["female"]

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [45]:
 surv_sex_class/surv_sex_class.loc["All"]

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

# Datos cualitativos ordinales

* Ej: Escala likert

# Datos cuantitativos discretos